pertemuan8/app/Controllers/AsdosController.php

    public function index()
    {
        $model = new Matkul();
        $data['matkul'] = $model->findAll();
---
SELECT *
FROM `matkul`

    public function edit($id_matkul)
    {
        $model = new Matkul();
        $data = $model->find($id_matkul);
---
SELECT *
FROM `matkul`
WHERE `matkul`.`id_matkul` = '3'